title: Detect TeamViewer Installation Directory Modification
description: Detects modifications to the TeamViewer installation directory.
status: experimental
logsource:
    category: file
    product: windows
detection:
    selection:
        FileDirectory:
            - 'C:\Program Files\TeamViewer\*'
            - 'C:\Program Files (x86)\TeamViewer\*'
    condition: selection
falsepositives:
    - Legitimate software updates or installations
level: medium